Revit 2027 API
ReinforcementRoundingSource Enumeration
 An enumerated type listing the possible sources for reinforcement rounding overrides.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ReinforcementRoundingSource
Public Enumeration ReinforcementRoundingSource
public enum class ReinforcementRoundingSource
type ReinforcementRoundingSource
Members
Member name | Value | Description
Element | 3 |  Rounding overrides from Rebar or RebarInSystem or FabricSheet or FabricArea instances are in use.
None | 0 |  No rounding overrides are in use.
ReinforcementSettings | 1 |  Rounding overrides from the ReinforcementSettings are in use.
Type | 2 |  Rounding overrides from the rebar types or fabric types are in use.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace